OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f66k22.h
extern __at(0x0F34) __sfr PR10;
extern __at(0x0F35) __sfr TMR10;

//==============================================================================
//        T8CON Bits

extern __at(0x0F36) __sfr T8CON;

typedef union
  {
  struct
    {
    unsigned T8CKPS0            : 1;
    unsigned T8CKPS1            : 1;
    unsigned TMR8ON             : 1;
    unsigned T8OUTPS0           : 1;
    unsigned T8OUTPS1           : 1;
    unsigned T8OUTPS2           : 1;
    unsigned T8OUTPS3           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T8CKPS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned T8OUTPS            : 4;
    unsigned                    : 1;
    };
  } __T8CONbits_t;

extern __at(0x0F36) volatile __T8CONbits_t T8CONbits;

#define _T8CKPS0                0x01
#define _T8CKPS1                0x02
#define _TMR8ON                 0x04
#define _T8OUTPS0               0x08
#define _T8OUTPS1               0x10
#define _T8OUTPS2               0x20
#define _T8OUTPS3               0x40

//==============================================================================

extern __at(0x0F37) __sfr PR8;
extern __at(0x0F38) __sfr TMR8;

//==============================================================================
//        T6CON Bits

extern __at(0x0F39) __sfr T6CON;

typedef union
  {
  struct
    {
    unsigned T6CKPS0            : 1;
    unsigned T6CKPS1            : 1;
    unsigned TMR6ON             : 1;
    unsigned T6OUTPS0           : 1;
    unsigned T6OUTPS1           : 1;
    unsigned T6OUTPS2           : 1;
    unsigned T6OUTPS3           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T6CKPS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned T6OUTPS            : 4;
    unsigned                    : 1;
    };
  } __T6CONbits_t;

extern __at(0x0F39) volatile __T6CONbits_t T6CONbits;

#define _T6CKPS0                0x01
#define _T6CKPS1                0x02
#define _TMR6ON                 0x04
#define _T6OUTPS0               0x08
#define _T6OUTPS1               0x10
#define _T6OUTPS2               0x20
#define _T6OUTPS3               0x40

//==============================================================================

extern __at(0x0F3A) __sfr PR6;
extern __at(0x0F3B) __sfr TMR6;

//==============================================================================
//        T7GCON Bits

extern __at(0x0F3C) __sfr T7GCON;

typedef union
  {
  struct
    {
    unsigned T7GSS0             : 1;
    unsigned T7GSS1             : 1;
    unsigned T7GVAL             : 1;
    unsigned T7GGO_NOT_T7DONE   : 1;
    unsigned T7GSPM             : 1;
    unsigned T7GTM              : 1;
    unsigned T7GPOL             : 1;
    unsigned TMR7GE             : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T7GGO              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_T7DONE         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T7GSS              : 2;
    unsigned                    : 6;
    };
  } __T7GCONbits_t;

extern __at(0x0F3C) volatile __T7GCONbits_t T7GCONbits;

#define _T7GSS0                 0x01
#define _T7GSS1                 0x02
#define _T7GVAL                 0x04
#define _T7GGO_NOT_T7DONE       0x08
#define _T7GGO                  0x08
#define _NOT_T7DONE             0x08
#define _T7GSPM                 0x10
#define _T7GTM                  0x20
#define _T7GPOL                 0x40
#define _TMR7GE                 0x80

//==============================================================================


//==============================================================================
//        T7CON Bits

extern __at(0x0F3D) __sfr T7CON;

typedef union
  {
  struct
    {
    unsigned TMR7ON             : 1;
    unsigned RD16               : 1;
    unsigned NOT_T7SYNC         : 1;
    unsigned SOSCEN             : 1;
    unsigned T7CKPS0            : 1;
    unsigned T7CKPS1            : 1;
    unsigned TMR7CS0            : 1;
    unsigned TMR7CS1            : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned T7CKPS             : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned TMR7CS             : 2;
    };
  } __T7CONbits_t;

extern __at(0x0F3D) volatile __T7CONbits_t T7CONbits;

#define _T7CON_TMR7ON           0x01
#define _T7CON_RD16             0x02
#define _T7CON_NOT_T7SYNC       0x04
#define _T7CON_SOSCEN           0x08
#define _T7CON_T7CKPS0          0x10
#define _T7CON_T7CKPS1          0x20
#define _T7CON_TMR7CS0          0x40
#define _T7CON_TMR7CS1          0x80

//==============================================================================

extern __at(0x0F3E) __sfr TMR7;
extern __at(0x0F3E) __sfr TMR7L;
extern __at(0x0F3F) __sfr TMR7H;

//==============================================================================
//        CCP10CON Bits

extern __at(0x0F40) __sfr CCP10CON;

typedef union
  {
  struct
    {
    unsigned CCP10M0            : 1;
    unsigned CCP10M1            : 1;
    unsigned CCP10M2            : 1;
    unsigned CCP10M3            : 1;
    unsigned DC10B0             : 1;
    unsigned DC10B1             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP10Y             : 1;
    unsigned CCP10X             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP10M             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC10B              : 2;
    unsigned                    : 2;
    };
  } __CCP10CONbits_t;

